def solution(n):
    # 1. n을 2부터 n까지 차례대로 나누어본다.
    # 2. 만약 나누어진다면 해당 결과값을 현재 n에다가 반영하고 나눈 값을 새로운 집합에 추가한다.-> 이미 나누었던 값이어도 set은 자체적으로 중복 제거라서 상관 X
    # 3. 리스트로 만들고 오름차순 정렬
    
    # 배열이랑 집합, 정수 변수 선언
    answer = []
    s = set()
    num = 2
    
    # n이 1인 경우 반복문 종료
    while(n != 1):
        for i in range(2,n+1):  # 2~n까지 나누어지는 값 i찾고 현재 n값에 나누어진 값을 반영한다.
            if n % i == 0:
                n = n // i
                s.add(i) # 해당 원소 집합에 추가
                break
    # 집합 -> 리스트로 변환, 오름차순 정렬
    s = list(s) 
    s.sort()
    return s
